       IDENTIFICATION DIVISION.
       PROGRAM-ID. GTBRCLR1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STATUS                PIC X(4) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL 'GTBRCLE1' USING BY REFERENCE WS-STATUS.
           GOBACK.
