       IDENTIFICATION DIVISION.
       PROGRAM-ID. GTCALC003.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MONTO            PIC 9(7)V99.
       01 WS-TASA             PIC 9(3)V99.
       01 WS-COMISION         PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MULTIPLY WS-MONTO BY WS-TASA GIVING WS-COMISION.
