       IDENTIFICATION DIVISION.
       PROGRAM-ID. GTCALC006.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MONTO            PIC 9(7)V99.
       01 WS-CUOTAS           PIC 9(2).
       01 WS-VALOR-CUOTA      PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DIVIDE WS-MONTO BY WS-CUOTAS GIVING WS-VALOR-CUOTA.
