       IDENTIFICATION DIVISION.
       PROGRAM-ID. GTCALC004.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SALDO            PIC 9(7)V99.
       01 WS-DEPOSITO         PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           ADD WS-DEPOSITO TO WS-SALDO.
