       IDENTIFICATION DIVISION.
       PROGRAM-ID. GTDVAL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RIESGO PIC 9 VALUE 1.
       01 WS-RIESGO-MAXIMO PIC 9 VALUE 3.
       01 WS-COD-RETORNO PIC X(4) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           IF WS-RIESGO > WS-RIESGO-MAXIMO
               MOVE 'PE04' TO WS-COD-RETORNO
           END-IF
           GOBACK.
