       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOMBAD1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MONTO PIC 9(7)V99.
       PROCEDURE DIVISION.
MAIN-PARA.
           GOBACK.
