       IDENTIFICATION DIVISION.
       PROGRAM-ID. CMTARROW1.
       DATA DIVISION.
*> THIS IS A FREE-FORMAT STYLE COMMENT LINE STARTING AT COLUMN ONE.
       WORKING-STORAGE SECTION.
       01 WS-MONTO PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO WS-MONTO.
           GOBACK.
