       IDENTIFICATION DIVISION.
       PROGRAM-ID. TABTEST1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	      01 WS-MONTO PIC 9(7)V99.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO WS-MONTO.
           GOBACK.
