000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SEQNUM1.
000030 DATA DIVISION.
000040 WORKING-STORAGE SECTION.
000050 01 WS-MONTO PIC 9(7)V99.
000060 01 WS-LIMITE PIC 9(7)V99 VALUE 1000.
000070 PROCEDURE DIVISION.
000080 MAIN-PARA.
000090     IF WS-MONTO > WS-LIMITE
000100         MOVE 1 TO WS-MONTO
000110     ELSE
000120         MOVE 0 TO WS-MONTO
000130     END-IF.
000140     GOBACK.
