       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYREPL1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY CPYGENERIC REPLACING ==WS-XXXX== BY ==WS-REPLACED==.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO WS-REPLACED.
           GOBACK.
