       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYMAIN1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY CPYWS01.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO WS-COPY-FIELD.
           GOBACK.
