       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYNEST1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY CPYOUTER.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 1 TO WS-INNER-FIELD.
           GOBACK.
