       IDENTIFICATION DIVISION.
       PROGRAM-ID. DCLGENMN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY DCLCLI.
       01 WS-RESULT PIC X(30) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE DCLCLI-NOMBRE TO WS-RESULT.
           GOBACK.
