       IDENTIFICATION DIVISION.
       PROGRAM-ID. DVALUEP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LIMITE PIC 9(4) VALUE 1000.
       01 WS-ESTADO PIC X VALUE 'A'.
       01 WS-COD-RETORNO PIC X(4) VALUE SPACES.
       01 WS-TOTAL PIC 9(3) VALUE ZERO.
       01 WS-CONTADOR PIC 9(3).
       01 WS-MULTI PIC X(2) VALUE '01' '02'.
       01 WS-RANGO PIC 9(3) VALUE 1 THRU 5.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 5000 TO WS-LIMITE
           DISPLAY WS-CONTADOR
           STOP RUN.
