       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIGCONST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ALPHA        PIC X(10) VALUE SPACES.
       01 WS-NUM          PIC 9(5) VALUE ZERO.
       01 WS-HIGH         PIC X(4) VALUE HIGH-VALUES.
       01 WS-LOW          PIC X(4) VALUE LOW-VALUES.
       01 WS-QUOTE        PIC X(4) VALUE QUOTE.
       01 WS-ALLX         PIC X(5).
       01 WS-ESTADO       PIC X.
          88 ESTADO-VACIO VALUE SPACE.
       01 WS-CONTADOR     PIC 9.
          88 CONTADOR-CERO VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE SPACES TO WS-ALPHA.
           MOVE ZEROS TO WS-NUM.
           MOVE ZEROES TO WS-NUM.
           MOVE HIGH-VALUE TO WS-HIGH.
           MOVE HIGH-VALUES TO WS-HIGH.
           MOVE LOW-VALUE TO WS-LOW.
           MOVE LOW-VALUES TO WS-LOW.
           MOVE QUOTES TO WS-QUOTE.
           MOVE ALL 'X' TO WS-ALLX.
           SET ESTADO-VACIO TO TRUE.
           SET CONTADOR-CERO TO TRUE.
           GOBACK.
