       IDENTIFICATION DIVISION.
       PROGRAM-ID. GAPCALLEE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LOCAL PIC X(4).
       LINKAGE SECTION.
       01 LK-X PIC X(10).
       01 LK-GROUP.
           05 LK-GROUP-FIELD-1 PIC X(5).
           05 LK-GROUP-FIELD-2 PIC X(5).
       01 LK-UNUSED PIC X(10).
       PROCEDURE DIVISION USING LK-X WS-LOCAL.
       MAIN-PARA.
           CALL 'GAPCALLER'
           STOP RUN.
