       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLERP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT PIC X(10).
       01 WS-FLAG PIC X(1).
       01 WS-RESULT PIC X(10).
       01 WS-PROGRAM-NAME PIC X(8).
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL 'CALLEEP' USING BY REFERENCE WS-INPUT
               BY CONTENT WS-FLAG
               RETURNING WS-RESULT
           CALL WS-PROGRAM-NAME USING WS-INPUT
           CALL 'MISSING-PROG'
           STOP RUN.
