       IDENTIFICATION DIVISION.
       PROGRAM-ID. P7MIDDLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LOCAL PIC X(10).
       LINKAGE SECTION.
       01 LK-IN PIC X(10).
       01 LK-RESULT PIC X(10).
       PROCEDURE DIVISION USING LK-IN RETURNING LK-RESULT.
       MAIN-PARA.
           CALL 'P7END' USING BY REFERENCE LK-IN
           MOVE '0009' TO LK-RESULT
           GOBACK.
