       IDENTIFICATION DIVISION.
       PROGRAM-ID. P7CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LIT PIC X(10).
       01 WS-RESULT PIC X(10).
       01 WS-PROGRAM-NAME PIC X(8).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE '0005' TO WS-LIT
           CALL 'P7MIDDLE' USING BY CONTENT WS-LIT RETURNING WS-RESULT
           CALL 'MISSING-PROG'
           CALL WS-PROGRAM-NAME
           STOP RUN.
