       IDENTIFICATION DIVISION.
       PROGRAM-ID. P7END.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-C-IN PIC X(10).
       PROCEDURE DIVISION USING LK-C-IN.
       MAIN-PARA.
           STOP RUN.
