       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLEEP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LOCAL PIC X(4).
       LINKAGE SECTION.
       01 LK-INPUT PIC X(10).
       01 LK-FLAG PIC X(1).
       01 LK-RESULT PIC X(10).
       PROCEDURE DIVISION USING LK-INPUT LK-FLAG RETURNING LK-RESULT.
       MAIN-PARA.
           MOVE LK-INPUT TO WS-LOCAL
           STOP RUN.
