       IDENTIFICATION DIVISION.
       PROGRAM-ID. MISSCPY1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY DOES-NOT-EXIST.
       PROCEDURE DIVISION.
       MAIN-PARA.
           GOBACK.
