       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOTERM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC X(1).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE 'A' TO WS-X.
