       IDENTIFICATION DIVISION.
       PROGRAM-ID. BAREEXIT.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM EXIT-PARA
           STOP RUN.
       EXIT-PARA.
           EXIT.
